import 'package:flutter/material.dart';
import './models/category.dart';
import './models/trip.dart';

const Categories_data = const [
  Category(
    id: 'c1',
    title: 'الرياض',
    sup_title: "نبذه تعريفيه عن الرياض",
    detail: "الرياض، عاصمة المملكة العربية السعودية، أصبحت في عام 2024 واحدة من أبرز وجهات السياحة في المنطقة، حيث تجمع بين الأصالة والحداثة. السياحة في الرياض 2024 تزدهر بفضل المشاريع الطموحة والفعاليات العالمية التي تستهدف جذب الزوار من مختلف أنحاء العالم.",
    imageUrl:
    'https://i.pinimg.com/736x/ca/d7/42/cad742624b366de6dbca080a0aa65f1e.jpg',
  ),
  Category(
    id: 'c2',
    title: 'عسير',
    sup_title: "نبذه تعريفيه عن عسير",
    detail: "عد منطقة عسير واحدة من أبرز وجهات السياحة في المملكة العربية السعودية، حيث تمتزج الطبيعة الساحرة مع التراث الثقافي الأصيل. تشتهر عسير بجمال جبالها الخضراء، مناخها المعتدل، وتراثها العريق، مما يجعلها وجهة مثالية لمحبي الطبيعة والثقافة.",
    imageUrl:
    'https://www.aljawharamag.com/aljawhara/uploads/2023/10/bfe0e87a-85cc-4e85-89c5-5837aab95446_16x9_1200x676.webp',
  ),
  Category(
    id: 'c3',
    title: 'جدة',
    sup_title: " نبذه تعريفيه عن جدة",
    detail: 'الملقبة بـ"عروس البحر الأحمر"، تُعتبر واحدة من أبرز الوجهات السياحية في المملكة العربية السعودية. تجمع المدينة بين التراث التاريخي والحداثة، مما يجعلها وجهة مفضلة للسياح من داخل وخارج المملكة',
    imageUrl:
    'https://www.lenobadir.org/wp-content/uploads/2022/07/jeddah-fountain.jpg',
  ),
  Category(
    id: 'c4',
    title: 'الأحساء',
    sup_title: "نبذه تعريفيه عن الأحساء",
    detail: 'الواقعة شرق المملكة العربية السعودية، تُعدّ واحدة من أهم الوجهات السياحية في البلاد بفضل طبيعتها الغنية، وتاريخها العريق، وتراثها الثقافي. تُعرف الأحساء بأنها أكبر واحة نخيل في العالم، وهي مدرجة في قائمة التراث العالمي لليونسكو، مما يجعلها وجهة مميزة لمحبي الثقافة والطبيعة.',
    imageUrl:
    'https://www.nawa3em.com/UserFiles/002-%D8%A7%D9%84%D8%A7%D8%AD%D8%B3%D8%A7%D8%A1.jpg',
  ),
  Category(
    id: 'c5',
    title: 'الشرقية',
    sup_title: " نبذه تعريفيه عن الشرقية",
    detail: "عد المنطقة الشرقية من أبرز وجهات السياحة في المملكة العربية السعودية، حيث تجمع بين الطبيعة الساحلية، المدن الحديثة، والثقافة العريقة. تضم المنطقة مدناً رئيسية مثل الدمام، الخبر، الظهران، والجبيل، وتتميز بتنوع معالمها التي تلبي جميع اهتمامات الزوار",
    imageUrl:
    'https://pbs.twimg.com/media/EYbBNxuWAAAehiN?format=jpg&name=large',
  ),
  Category(
    id: 'c6',
    title: 'العلا',
    sup_title: " نبذه تعريفيه عن العلا",
    detail: "واحدة من أروع الوجهات السياحية في المملكة العربية السعودية، تُعدّ مزيجًا من التاريخ العريق، الطبيعة الخلابة، والمغامرات الفريدة. تقع في شمال غرب المملكة، وتشتهر بمعالمها التاريخية التي تعود إلى آلاف السنين، وأصبحت وجهة مميزة للسياحة العالمية بعد فتحها للزوار",
    imageUrl:
    'https://media.assettype.com/sabq%2Fimport%2Fuploads%2Fmaterial-file%2F5e15a10b544a69dff28b4585%2F5e15a10804b91.jpg?w=1024&auto=format%2Ccompress&fit=max',
  ),
  Category(
    id: 'c7',
    title: 'مكة المكرمة',
    sup_title: " نبذه تعريفيه عن مكة المكرمة",
    detail: "هي أقدس مدينة في الإسلام، وتعد وجهة رئيسية لملايين المسلمين من جميع أنحاء العالم، حيث يقصدها الحجاج والمعتمرون سنويًا. بالإضافة إلى طابعها الديني، تحتوي مكة على معالم تاريخية وثقافية مميزة تجعلها وجهة فريدة",
    imageUrl:
    'https://i.pinimg.com/736x/a5/06/59/a5065961f1bc853d63fa3ba531d15b48.jpg',
  ),
];

const Categories_data_active = const [
  Category(

    id: 'c8',
    title: 'الشواطئ',
    sup_title: "c5,c3",
    detail: "",
    imageUrl:
    'https://i.pinimg.com/736x/46/e0/78/46e078946cbcba27db81b1b4a1ffb040.jpg',
  ),
  Category(
    id: 'c8',
    title: 'الاماكن الدينية',
    sup_title: "c7",
    detail: "",
    imageUrl:
    'https://cdn.arabsstock.com/uploads/images/283533/image-283533-royal-clock-tower-building-qiblah-islam-muslims-worship-g-thumbnail.webp',
  ),
  Category(
    id: 'c8',
    title: 'الاماكن التراثية',
    sup_title: "c3,c4,c6",
    detail: "",
    imageUrl:
    'https://i.pinimg.com/236x/55/6a/c9/556ac9d5ce526c6416cc17a82e06a7e4.jpg',
  ),

Category(
    id: 'c8',
    title: 'جبال',
    sup_title: "c6,c2",
    detail: "",
    imageUrl:
    'https://img.pikbest.com/wp/202345/hands-raised-person-standing-on-top-of-a-mountain-with_9601557.jpg!sw800',
  ),

];

const Trips_data = const [
// الرياض
  Trip(
    id: 'm909',
    categories: [
      'c1',
    ],
    title: 'الفنادق',
    tripType: TripType.Exploration,
    season: Season.Winter,
    imageUrl:
    'https://www.ahstatic.com/photos/7326_ho_00_p_1024x768.jpg',
    duration: 20,
    activities: [
      'فندق الريتز كارلتون الرياض : \n أيقونة فخامة في قلب المدينة، يوفر غرفاً راقية، خدمات استثنائية، ومرافق تشمل منتجعاً صحياً ومجموعة مطاعم عالمية. مشهور بالتصميم المعماري الأنيق والمساحات الواسعة.',
      'فندق فيرمونت الرياض : \n يقع بالقرب من المناطق التجارية الرئيسية ويتميز بتصميم عصري وخدمة راقية. مثالي لرجال الأعمال والمسافرين الباحثين عن الرفاهية.',
      'فندق نارسيس الرياض : \n يجمع بين الفخامة والراحة مع أجنحة فخمة وخيارات متنوعة للطعام، بالإضافة إلى سبا فاخر. موقعه المركزي يجعله خياراً مثالياً للسياح.',
      'فندق فورسيزونز الرياض : \n يقع في برج المملكة ويوفر إطلالات خلابة على المدينة. يشتهر بمستوى الخدمة الفاخر والمطاعم المميزة.',
      'فندق حياة ريجنسي الرياض العليا : \n يوفر تجربة إقامة حديثة ومريحة مع خدمات راقية ومرافق ممتازة .مناسب للعائلات ورجال الأعمال ',

    ],
    program: [
      '',
    ],
    isInSummer: false,
    isForFamilies: true,
    isInWinter: true,
  ),

  Trip(
    id: 'm1',
    categories: [
      'c1',
    ],
    title: 'المطاعم',
    tripType: TripType.Exploration,
    season: Season.Winter,
    imageUrl:
    'https://cdn.saudigates.net/wp-content/uploads/2022/01/%D9%85%D8%B7%D8%A7%D8%B9%D9%85-%D9%81%D8%AE%D9%85%D9%87-%D8%A8%D8%A7%D9%84%D8%B1%D9%8A%D8%A7%D8%B6.jpg',
    duration: 20,
    activities: [
     'مطعم لامير : \n مطبخ فرنسي فاخر يقدم أطباقاً كلاسيكية مع لمسة عصرية. أجواء رومانسية مثالية للعشاء الفاخر.'
     ,
     'مطعم سبازيو : \n يقع في الطابق 77 من برج المملكة، ويوفر تجربة تناول طعام مع إطلالة بانورامية. يقدم مأكولات إيطالية وعالمية راقية.'
     ,
     'مطعم ذا غلوب (The Globe) : \nأحد أكثر المطاعم شهرة، يقع داخل كرة زجاجية في برج الفيصلية. يقدم أطباقاً عالمية فاخرة مع تجربة تناول طعام استثنائية.'
     ,'مطعم زعفران الهندي : \nيقدم أطباق هندية تقليدية بمكونات فاخرة ونكهات غنية. أجواء مريحة وخدمة ممتازة.',
     'مطعم ماما نورة : \n مطعم شعبي يقدم أشهى المأكولات السعودية والعربية. يشتهر بالكباب، الشاورما، والمقبلات بأسعار مناسبة وجودة عالية. ',
     'مطعم كوي (Koi) : \n مطعم آسيوي يقدم السوشي وأطباقاً مميزة مستوحاة من المطبخ الياباني. تصميمه الحديث يجعله من الوجهات المفضلة لعشاق المأكولات الآسيوية ',


     ],
    program: [
      '',
      
    ],
    isInSummer: false,
    isForFamilies: true,
    isInWinter: true,
  ),
   Trip(
    id: 'm2',
    categories: [
      'c1',
    ],
    title: 'الترفيه',
    tripType: TripType.Exploration,
    season: Season.Winter,
    imageUrl:
    'https://traveltalez.com/blog/wp-content/uploads/2020/08/tourism-in-saudi-arabia.jpg',
    duration: 20,
    activities: [
     'بوليفارد رياض سيتي : \n وجهة متكاملة تضم العديد من الفعاليات الترفيهية، المطاعم الفاخرة، والعروض الحية.',
     'العلا التاريخية: \n وجهة قريبة تقدم تجربة ثقافية فريدة تتضمن استكشاف التاريخ القديم للجزيرة العربية.',
     'واحة الدرعية: \n منطقة تاريخية مدرجة في قائمة التراث العالمي لليونسكو وتضم أسواقاً تقليدية ومتاحف تعكس الثقافة السعودية.',
     'برج المملكة وبرج الفيصلية: \n معالم معمارية مميزة توفر إطلالات خلابة على المدينة وتجارب تسوق'

    ],
    program: [
     '',
    ],
    isInSummer: false,
    isForFamilies: true,
    isInWinter: true,
  ),


// عسير
  Trip(
    id: 'm6',
    categories: [
      'c2',
    ],
    title: 'الفنادق',
    tripType: TripType.Exploration,
    season: Season.Summer,
    imageUrl:
    'https://www.ahstatic.com/photos/7326_ho_00_p_1024x768.jpg',
    duration: 240,
    activities: [
     'فندق بلو إن بوتيك (Blue Inn Boutique) - أبها : \N فندق بوتيكي راقٍ يقدم تجربة إقامة فاخرة مع إطلالات على جبال عسير. يتميز بموقع مركزي قريب من المعالم الرئيسية.',
     'منتجع أبها إنتركونتيننتال (InterContinental Abha) : \n  يوفر إطلالات خلابة على جبال السودة، مع مرافق فاخرة تشمل منتجعاً صحياً ومطاعم عالمية. خيار مثالي للعائلات والأزواج.',
     'منتجع السودة هايتس (Al Soudah Heights) : \n يقع بالقرب من جبل السودة، ويتميز بالأجواء الهادئة والطبيعة الخضراء. يوفر فيلات وأجنحة فاخرة لعشاق الطبيعة والخصوصية.',
     'فندق قصر أبها (Abha Palace Hotel) : \n واحد من أشهر الفنادق في المنطقة، يقع بجانب بحيرة سد أبها. يتميز بمرافق حديثة وتصميم أنيق يناسب المسافرين الباحثين عن الرفاهية. منتجع رجال ألمع التراثي تجربة إقامة فريدة داخل منازل تراثية تم تحويلها إلى غرف فندقية. يقدم فرصة للتعرف على ثقافة المنطقة وسط الطبيعة الساحرة',
     

    ],
    program: [
     ''
    ],
    isInSummer: true,
    isForFamilies: false,
    isInWinter: false,
  ),
 Trip(
    id: 'm6435',
    categories: [
      'c2',
    ],
    title: 'المطاعم',
    tripType: TripType.Exploration,
    season: Season.Summer,
    imageUrl:
    'https://cdn.saudigates.net/wp-content/uploads/2022/01/%D9%85%D8%B7%D8%A7%D8%B9%D9%85-%D9%81%D8%AE%D9%85%D9%87-%D8%A8%D8%A7%D9%84%D8%B1%D9%8A%D8%A7%D8%B6.jpg',
    duration: 240,
    activities: [
     'مطعم حدائق الفيصلية - أبها : \n يقدم مأكولات سعودية تقليدية وأطباقاً متنوعة من المطبخ العربي. يتميز بجلسات عائلية مريحة وإطلالات جميلة.',
     'مطعم سافور (Savor) - أبها : \n مطعم عصري يقدم مزيجاً من الأطباق العالمية والمحلية. أجواء فاخرة مثالية للوجبات العائلية أو العشاء الرومانسي.',
     'مطعم القرية التراثية - أبها : \n يقدم أطباقاً محلية تقليدية مثل الحنيذ والمظبي في أجواء مستوحاة من التراث العسيري. تجربة تناول طعام تجمع بين الأصالة والضيافة.',
     'مطعم المهباج - خميس مشيط : \n يشتهر بتقديم المأكولات الشعبية مثل العصيدة والمرقوق والجريش. يتميز بأجواء تقليدية وخدمة ممتازة. ',
     'مطعم السنارة - أبها : \n متخصص في المأكولات البحرية الطازجة، ويقدم أطباقاً مميزة مثل السمك المشوي والمقبلات البحرية. موقعه وإطلالته يجعلان منه وجهة مميزة لمحبي الأكل البحري. ',
     'مقهى ومطعم الدار - رجال ألمع : \n مطعم ومقهى يقدم تجربة تقليدية في قلب قرية رجال ألمع. يقدم وجبات خفيفة، قهوة عربية، وأطباقاً محلية وسط أجواء تراثية ',
     

    ],
    program: [
     ''
    ],
    isInSummer: true,
    isForFamilies: false,
    isInWinter: false,
  ),
 Trip(
    id: 'm63424445',
    categories: [
      'c2',
    ],
    title: 'الترفيه',
    tripType: TripType.Exploration,
    season: Season.Summer,
    imageUrl:
    'https://traveltalez.com/blog/wp-content/uploads/2020/08/tourism-in-saudi-arabia.jpg',
    duration: 240,
    activities: [
     'مدينة أبها : \n عاصمة عسير وأحد أشهر المدن السياحية، تُعرف بـ"عروس الجنوب". تضم معالم شهيرة مثل:',
     'جبل السودة: \n أعلى قمة في المملكة، يوفر إطلالات خلابة وتجارب مميزة لمحبي المغامرة والتسلق.',
     'منتزه عسير الوطني: \n وجهة مثالية للاستمتاع بالطبيعة البكر، والمشي بين الغابات، والتمتع بأجواء هادئة',
     'رجال ألمع : \n قرية تراثية مدرجة في قائمة التراث العالمي لليونسكو، تشتهر بمنازلها الحجرية المزينة بالنقوش الملونة.  مكان مثالي لاستكشاف التراث العسيري والثقافة المحلية. ',
     'قرية الحبلة : \n وجهة سياحية فريدة تقع على حافة الجبال، تتميز بإطلالات مذهلة وطرقها الجبلية التاريخية. مكان رائع لعشاق التصوير واستكشاف الطبيعة. ',
     'مدينة خميس مشيط : \n  مركز تجاري وسياحي يضم أسواقاً تقليدية ومطاعم تقدم المأكولات المحلية. معروفة بمزارعها الطبيعية ومنتجاتها التقليدي ',
     

    ],
    program: [
     ''
    ],
    isInSummer: true,
    isForFamilies: false,
    isInWinter: false,
  ),
  // جدة
  Trip(
    id: 'm87498',
    categories: [
      'c3',
    ],
    title: 'الفنادق',
    tripType: TripType.Exploration,
    season: Season.Winter,
    imageUrl:
    'https://www.ahstatic.com/photos/7326_ho_00_p_1024x768.jpg',
    duration: 20,
    activities: [
     'فندق هيلتون جدة : \n يتميز بموقعه على الكورنيش وإطلالاته الخلابة على البحر الأحمر. يوفر خدمات راقية تشمل مطاعم فاخرة ومرافق لياقة بدنية.',
     'فندق روزوود جدة : \n من الفنادق الفاخرة التي تجمع بين التصميم العصري والخدمات الراقية، ويشتهر بموقعه المميز على الكورنيش.',
     'فندق سويس أوتيل ليفينغ جدة : \n يقدم أجنحة مميزة مع خدمات شاملة مثل المسابح ومراكز اللياقة البدنية. مثالي للإقامات الطويلة.',
     'هوليداي إن جدة السلام : \n خيار مناسب يقع في وسط المدينة، يوفر غرف مريحة وخدمات عائلية وتجارية عالية الجودة.',
     'فندق نوفوتيل جدة : \n يتمتع بموقع استراتيجي في قلب المدينة، بالقرب من المطاعم والمعالم السياحية، ويقدم خدمات متوسطة بأسعار معقولة. ',
     'فندق كلاريون جدة المطار : \n قع بالقرب من مطار الملك عبد العزيز، مما يجعله خيارًا مثاليًا للمسافرين.',
     'فندق إنتركونتيننتال جدة : \n يوفر إقامة فاخرة وخدمات متميزة مع إطلالات خلابة على الكورنيش.',
     ' فندق راديسون بلو جدة : \n يتميز بخدماته المتكاملة وموقعه بالقرب من المعالم الرئيسية في المدينة. ',
     'فندق إيلاف جدة : \n يقع بالقرب من مول البحر الأحمر، ويوفر غرفًا عصرية وخدمات مناسبة للعائلات ورجال الأعمال.',
     'فندق أصيلة : \n من الفنادق الراقية في حي الأندلس، يقدم تجربة فاخرة تشمل مطاعم عالمية وخدمات فندقية متكاملة.',
     
    ],
    program: [
      
    ],
    isInSummer: true,
    isForFamilies: false,
    isInWinter: false,
  ),
   Trip(
    id: 'm78748',
    categories: [
      'c3',
    ],
    title: 'المطاعم',
    tripType: TripType.Exploration,
    season: Season.Winter,
    imageUrl:
    'https://cdn.saudigates.net/wp-content/uploads/2022/01/%D9%85%D8%B7%D8%A7%D8%B9%D9%85-%D9%81%D8%AE%D9%85%D9%87-%D8%A8%D8%A7%D9%84%D8%B1%D9%8A%D8%A7%D8%B6.jpg',
    duration: 20,
    activities: [
     'مطعم ميازو (Myazu): \n مطعم ياباني فاخر في البساتين مول، يشتهر بالسوشي وأطباق التمبورا وسط أجواء أنيقة.',
     'مطعم بامباس: \n مطعم أرجنتيني يقدم وجبات لحم واقيو والأطباق البحرية في فندق أصيلة بحي الأندلس.',
     'مطعم خيال: \n متخصص في المشويات التركية، يقدم أطباقًا مثل الكباب، الفطائر، والحلويات التركية.',
     'مطعم جينجر ليف (Ginger Leaf): \n وجهة لمحبي الأطباق الهندية والآسيوية، يقدم وجبات مثل دجاج المسالا في حي الشاطئ. ',
     'سمبل برقر: \n يقدم برجر محلي الصنع بنكهات مبتكرة ويقع في حي الزهراء.',
     'ذا باي (The By): \n مطعم هندي يتميز بأطباق شهيرة مثل البرياني ودجاج المسالا في حي البوادي.',
     'فليمز ستيك هاوس: \n يقدم أشهى وجبات الستيك المشوي والدجاج المشوي في حي الأمير سلطان.',
     'إل بي (El-B):\n مطعم يقدم بيتزا بأسلوب عصري وإبداعي في حي الروضة.',
     'مطعم ناندوز: \n متخصص في أطباق الدجاج المشوي بخلطات مميزة، ويقع في مول البحر الأحمر.',
     'مطعم لو سيال (Le Ciel):\n مطعم دوار يقدم تجربة طعام راقية وإطلالة بانورامية على جدة.',
     
    ],
    program: [
      
    ],
    isInSummer: true,
    isForFamilies: false,
    isInWinter: false,
  ),
   Trip(
    id: 'm89_kha87',
    categories: [
      'c3',
    ],
    title: 'الترفيه',
    tripType: TripType.Exploration,
    season: Season.Winter,
    imageUrl:
    'https://traveltalez.com/blog/wp-content/uploads/2020/08/tourism-in-saudi-arabia.jpg',
    duration: 20,
    activities: [
     'كورنيش جدة : \n  يمتد على طول البحر الأحمر ويوفر مناظر خلابة، مسارات للمشي، ومجموعة من المقاهي والمطاعم. يتميز بمعالم مثل نافورة الملك فهد، التي تُعد الأطول في العالم. ',
     'البلد (المدينة القديمة) : \n منطقة تاريخية مدرجة في قائمة التراث العالمي لليونسكو.  تضم بيوتاً تقليدية مثل بيت نصيف، وأسواقاً مثل سوق العلوي الشهير.  واجهة جدة البحرية (JW)',
     'مشروع حديث يوفر مساحات خضراء، ملاعب للأطفال، وشواطئ جميلة. مكان مثالي للعائلات وممارسي الرياضة.',
     'أبحر الشمالية والجنوبية مناطق مميزة للاستمتاع بالشواطئ، الرياضات المائية، واليخوت الفاخرة. مدينة الملك عبدالله الاقتصادية (KAEC) ',
     'وجهة حديثة على بعد ساعة من جدة، تضم شواطئ جميلة ومرافق ترفيهية',
    ],
    program: [
      
    ],
    isInSummer: true,
    isForFamilies: false,
    isInWinter: false,
  ),


// الأحساء
  Trip(
    id: 'm7_98kha87',
    categories: [
      'c4',
    ],
    title: 'الفنادق',
    tripType: TripType.Exploration,
    season: Season.Winter,
    imageUrl:
    'https://www.ahstatic.com/photos/7326_ho_00_p_1024x768.jpg',
    duration: 20,
    activities: [
     'فندق الأحساء إنتركونتيننتال : \n فندق فاخر يجمع بين التصميم العربي التقليدي والخدمات الحديثة. يوفر إطلالات على الواحة وغرفاً مريحة. ',
     'فندق جراند ليليو الأحساء : \n خيار مثالي للعائلات ورجال الأعمال، يتميز بموقع مركزي ومرافق متكاملة.',
     'فندق الكوت التراثي : \n  يقدم تجربة فريدة تجمع بين الإقامة الحديثة واللمسة التراثية. مناسب للزوار الباحثين عن تجربة ثقافية ',
    ],
    program: [
      
    ],
    isInSummer: true,
    isForFamilies: false,
    isInWinter: false,
  ),
  Trip(
    id: 'm457_kha87',
    categories: [
      'c4',
    ],
    title: 'المطاعم',
    tripType: TripType.Exploration,
    season: Season.Winter,
    imageUrl:
    'https://cdn.saudigates.net/wp-content/uploads/2022/01/%D9%85%D8%B7%D8%A7%D8%B9%D9%85-%D9%81%D8%AE%D9%85%D9%87-%D8%A8%D8%A7%D9%84%D8%B1%D9%8A%D8%A7%D8%B6.jpg',
    duration: 20,
    activities: [
     'مطعم خيال : \N يقدم أطباقاً محلية وعربية أصيلة، مثل الكبسة والمشاوي، في أجواء راقية. ',
     'مطعم زمان الأول : \n  مطعم شعبي يقدم المأكولات التقليدية في أجواء مستوحاة من التراث الأحسائي. ',
     'مطعم بيت الروبيان : \n  وجهة لعشاق المأكولات البحرية الطازجة. ',
     'مطعم السنبوك : \n مطعم فاخر يقدم أطباقاً عالمية مع لمسة محلية، ويشتهر بأطباق الأسماك ',
    
    ],
    program: [
      
    ],
    isInSummer: true,
    isForFamilies: false,
    isInWinter: false,
  ),
  Trip(
    id: 'm745_kha87',
    categories: [
      'c4',
    ],
    title: 'الترفيه',
    tripType: TripType.Exploration,
    season: Season.Winter,
    imageUrl:
    'https://traveltalez.com/blog/wp-content/uploads/2020/08/tourism-in-saudi-arabia.jpg',
    duration: 20,
    activities: [
     'واحة الأحساء : \n تُعتبر أكبر واحة نخيل طبيعية في العالم، وتضم أكثر من 2.5 مليون نخلة.  تقدم تجربة فريدة للاستمتاع بالطبيعة والمزارع المحلية.',
     'جبل القارة : \n أحد أشهر المعالم الطبيعية في الأحساء، يتميز بتكويناته الصخرية الفريدة والكهوف الباردة.  يوفر تجربة رائعة لعشاق المغامرة والتصوير.',
     'سوق القيصرية : \n سوق تاريخي يعود إلى مئات السنين، يشتهر بالحرف اليدوية، المنتجات التقليدية، والتوابل. مكان مثالي للتسوق واستكشاف التراث المحلي.',
     'قصر إبراهيم الأثري : \n معلم تاريخي يعود إلى الحقبة العثمانية، يضم أبراجاً وأسواراً تعكس العمارة الإسلامية التقليدية. مكان مميز لاستكشاف تاريخ المنطقة. ',
     'بحيرة الأصفر : \n بحيرة طبيعية محاطة بالكثبان الرملية والنخيل، وتُعتبر وجهة مثالية لمحبي الطبيعة والتخييم.',
     
    ],
    program: [
      
    ],
    isInSummer: true,
    isForFamilies: false,
    isInWinter: false,
  ),


// الشرقية
  Trip(
    id: 'm7_k45ha87',
    categories: [
      'c5',
    ],
    title: 'الفنادق',
    tripType: TripType.Exploration,
    season: Season.Winter,
    imageUrl:
    'https://www.ahstatic.com/photos/7326_ho_00_p_1024x768.jpg',
    duration: 20,
    activities: [
     'فندق موفنبيك الخبر : \n فندق فاخر يتميز بإطلالات خلابة على الخليج العربي، وموقع مركزي قريب من المعالم السياحية.',
     'فندق كمبينسكي العثمان الدمام : \n خيار راقٍ يوفر غرفاً حديثة ومرافق مميزة، مثل السبا والمطاعم الفاخرة.',
     'فندق لو مريديان الخبر : \n يقع على الكورنيش، ويوفر غرفاً راقية، مسبحاً، ومجموعة من الأنشطة الترفيهية.',
     'فندق جولدن توليب الدمام : \n مناسب للعائلات ورجال الأعمال، ويوفر غرفاً مريحة بأسعار معقولة ',
     
    ],
    program: [
      
    ],
    isInSummer: true,
    isForFamilies: false,
    isInWinter: false,
  ),
  Trip(
    id: 'm7_k45ha8734',
    categories: [
      'c5',
    ],
    title: 'المطاعم',
    tripType: TripType.Exploration,
    season: Season.Winter,
    imageUrl:
    'https://cdn.saudigates.net/wp-content/uploads/2022/01/%D9%85%D8%B7%D8%A7%D8%B9%D9%85-%D9%81%D8%AE%D9%85%D9%87-%D8%A8%D8%A7%D9%84%D8%B1%D9%8A%D8%A7%D8%B6.jpg',
    duration: 20,
    activities: [
     'مطعم السنبوك (الخبر) : \n وجهة مميزة لعشاق المأكولات البحرية، يقدم أطباقاً طازجة مع إطلالة ساحرة على البحر.',
     'مطعم برجريشن (الدمام) : \n يقدم برغر مميز مع تشكيلة من الأطباق السريعة في أجواء عصرية.',
     'مطعم لي شاتو (الخبر) : \n مطعم فرنسي راقٍ يقدم أطباقاً عالمية في أجواء فاخرة.',
     'مطعم القرية الشعبية (الدمام) : \n مكان مثالي لتجربة المأكولات السعودية التقليدية في أجواء تراثية أصيلة ',
    ],
    program: [
      
    ],
    isInSummer: true,
    isForFamilies: false,
    isInWinter: false,
  ),
  Trip(
    id: 'm7_k45ha8547',
    categories: [
      'c5',
    ],
    title: 'الترفيه ',
    tripType: TripType.Exploration,
    season: Season.Winter,
    imageUrl:
    'https://traveltalez.com/blog/wp-content/uploads/2020/08/tourism-in-saudi-arabia.jpg',
    duration: 20,
    activities: [
     'كورنيش الخبر : \n مكان رائع للاسترخاء، يمتد على طول ساحل الخليج العربي، ويضم مسارات للمشي، مناطق ألعاب للأطفال، ومجموعة من المطاعم والمقاهي.',
     'جسر الملك فهد : \n معلم مميز يربط بين السعودية والبحرين، ويوفر مناظر خلابة على الخليج. ',
     'شاطئ نصف القمر : \n وجهة مميزة لمحبي الشواطئ والأنشطة المائية مثل السباحة وركوب القوارب.',
     'منتزه الملك عبد الله البيئي في الأحساء : \n يضم نافورة راقصة، مساحات خضراء، ومرافق ترفيهية، مما يجعله وجهة مثالية للعائلات.',
     'الجبيل الصناعية : \n مدينة حديثة تتميز بمرافقها المتطورة وشواطئها النظيفة، مثل شاطئ النخيل.',
     'جزيرة المرجان في الدمام : \n جزيرة صناعية تقع قبالة كورنيش الدمام، توفر مناطق ترفيهية ومناظر طبيعية رائعة ',
    ],
    program: [
      
    ],
    isInSummer: true,
    isForFamilies: false,
    isInWinter: false,
  ),


// العلا
  Trip(
    id: 'm7_kha8237',
    categories: [
      'c6',
    ],
    title: 'الفنادق ',
    tripType: TripType.Exploration,
    season: Season.Winter,
    imageUrl:
  'https://www.ahstatic.com/photos/7326_ho_00_p_1024x768.jpg',
    duration: 20,
    activities: [
     'منتجع حِجر (Habitas AlUla) : \n منتجع فاخر مستدام وسط الطبيعة، يقدم تجربة فريدة تجمع بين الفخامة والاسترخاء.',
     'منتجع شرعان : \n منتجع راقٍ داخل جبال شرعان، يقدم إقامة استثنائية مستوحاة من الطبيعة المحيطة.',
     'كمبينسكي العلا : \n فندق فاخر يقدم أجواء مميزة وخدمات راقية مع إطلالات مذهلة.',
     'فندق شادن الصحراوي : \n يوفر تجربة مميزة للإقامة في قلب الصحراء مع مرافق حديثة وأجواء هادئة',
     
    ],
    program: [
      
    ],
    isInSummer: true,
    isForFamilies: false,
    isInWinter: false,
  ),
   Trip(
    id: 'm7897_kha8237',
    categories: [
      'c6',
    ],
    title: 'المطاعم  ',
    tripType: TripType.Exploration,
    season: Season.Winter,
    imageUrl:
  'https://cdn.saudigates.net/wp-content/uploads/2022/01/%D9%85%D8%B7%D8%A7%D8%B9%D9%85-%D9%81%D8%AE%D9%85%D9%87-%D8%A8%D8%A7%D9%84%D8%B1%D9%8A%D8%A7%D8%B6.jpg',
    duration: 20,
    activities: [
    'مطعم سهيل : \n يقدم تجربة طعام راقية مع أطباق سعودية تقليدية بلمسة عصرية.',
    'مطعم تانج ; \n مطعم فاخر يقدم أطباقاً آسيوية مستوحاة من المطبخ الصيني والياباني.',
    'مطعم الواحة : \n يقدم المأكولات العالمية والمحلية في أجواء طبيعية ساحرة.',
    'مطعم أنابيل \n مكان مثالي للاستمتاع بوجبة فاخرة مع إطلالات خلابة على المعالم الطبيعية ',
    
     
    ],
    program: [
      
    ],
    isInSummer: true,
    isForFamilies: false,
    isInWinter: false,
  ),
   Trip(
    id: 'm7897_kha8238747',
    categories: [
      'c6',
    ],
    title: 'الترفيه',
    tripType: TripType.Exploration,
    season: Season.Winter,
    imageUrl:
  'https://traveltalez.com/blog/wp-content/uploads/2020/08/tourism-in-saudi-arabia.jpg',
    duration: 20,
    activities: [
   'مدائن صالح (الحِجر) : \n أول موقع سعودي مدرج في قائمة التراث العالمي لليونسكو. يضم مقابر منحوتة في الصخور تعود إلى حضارة الأنباط، تشبه تلك الموجودة في البتراء بالأردن. ',
   'جبل الفيل : \n معلم طبيعي مذهل عبارة عن صخرة ضخمة على شكل فيل، محاطة بالكثبان الرملية، مما يجعلها مكانًا مثاليًا للتصوير.',
   'البلدة القديمة في العلا : \n مدينة تاريخية تضم بيوتًا وأسواقًا قديمة تعكس الحياة في العصور الماضية.  تتميز بالممرات الضيقة والمساجد الأثرية.',
   'وادي عشار : \n منطقة طبيعية رائعة محاطة بجبال مهيبة، تُستخدم كموقع لاستضافة الفعاليات والأنشطة الثقافية.',
     'صخرة عكمة : \n موقع أثري يحتوي على نقوش تاريخية تُعرف باسم "مكتبة العلا المفتوحة',
    ],
    program: [
      
    ],
    isInSummer: true,
    isForFamilies: false,
    isInWinter: false,
  ),


// مكة المكرمة
Trip(
    id: 'm7_kh12a87',
    categories: [
      'c7',
    ],
    title: 'الفنادق',
    tripType: TripType.Exploration,
    season: Season.Winter,
    imageUrl:
    'https://www.ahstatic.com/photos/7326_ho_00_p_1024x768.jpg',
    duration: 20,
    activities: [
     'فندق برج الساعة فيرمونت : \n فندق فاخر يقع بجوار المسجد الحرام، يوفر إطلالات مذهلة على الكعبة.',
     'فندق مكة هيلتون للمؤتمرات : \n يقدم خدمات عالية الجودة ومرافق مميزة مع إطلالات على الحرم.',
     'فندق رافلز مكة بالاس : \n يوفر أجنحة فاخرة وتصاميم داخلية مستوحاة من الثقافة الإسلامية.',
     'فندق جبل عمر حياة ريجنسي : \n خيار مميز يوفر الراحة والقرب من المسجد الحرام.',
     'فندق بولمان زمزم مكة : \n يُعرف بمرافقه الحديثة وخدماته الممتازة، مناسب للعائلات',
     
    ],
    program: [
      
    ],
    isInSummer: true,
    isForFamilies: false,
    isInWinter: false,
  ),
  Trip(
    id: 'm7_kh54a87',
    categories: [
      'c7',
    ],
    title: 'المطاعم',
    tripType: TripType.Exploration,
    season: Season.Winter,
    imageUrl:
    'https://cdn.saudigates.net/wp-content/uploads/2022/01/%D9%85%D8%B7%D8%A7%D8%B9%D9%85-%D9%81%D8%AE%D9%85%D9%87-%D8%A8%D8%A7%D9%84%D8%B1%D9%8A%D8%A7%D8%B6.jpg',
    duration: 20,
    activities: [
     'مطعم الطازج : \n يقدم وجبات سعودية وعربية سريعة، وهو من أشهر المطاعم في المملكة. ',
     'مطعم البيك : \n وجهة مميزة لعشاق البروستد والمأكولات السريعة.',
     'مطعم الدوار المصري : \n متخصص في تقديم الأطباق المصرية الأصيلة مثل الفول والطعمية.',
     'مطعم الطعم الحقيقي (The Real Taste) : \n يقدم أطباقًا هندية وعالمية متنوعة.',
     'مطعم زاد الحرمين : \n يوفر تجربة فريدة لتناول الطعام مع إطلالة قريبة على الحرم',
    ],
    program: [
      
    ],
    isInSummer: true,
    isForFamilies: false,
    isInWinter: false,
  ),
  Trip(
    id: 'm7_kh54a87',
    categories: [
      'c7',
    ],
    title: 'الترفيه ',
    tripType: TripType.Exploration,
    season: Season.Winter,
    imageUrl:
    'https://traveltalez.com/blog/wp-content/uploads/2020/08/tourism-in-saudi-arabia.jpg',
    duration: 20,
    activities: [
     'المسجد الحرام والكعبة المشرفة : \n أعظم وأهم معلم في مكة والعالم الإسلامي. \n ضم الكعبة المشرفة، مقام إبراهيم، وبئر زمزم.  \n مكان يستقطب المسلمين للعبادة، الدعاء، والطواف. ',
     'جبل النور (غار حراء) : \n الجبل الذي شهد نزول أولى آيات القرآن الكريم على النبي محمد ﷺ. \n يُعتبر وجهة روحانية لمحبي استكشاف التاريخ الإسلامي. \n ',
     'جبل ثور (غار ثور) : \n الجبل الذي اختبأ فيه النبي محمد ﷺ وأبو بكر الصديق أثناء الهجرة إلى المدينة المنورة. ',
     'متحف مكة المكرمة : \n يعرض تاريخ مكة المكرمة عبر العصور، بما في ذلك القطع الأثرية والمخطوطات الإسلامية. ',
     'برج الساعة (أبراج البيت) : \n أطول برج ساعة في العالم، يحتوي على مركز تسوق فخم ومتحف إسلامي رائع. \n يوفر منصة مراقبة تمنحك إطلالات بانورامية على مكة والمسجد الحرام. \n مشعر عرفات ومنى ومزدلفة أماكن مقدسة للحج، تلعب دورًا أساسيًا في مناسك الحج السنوية ',
    ],
    program: [
      
    ],
    isInSummer: true,
    isForFamilies: false,
    isInWinter: false,
  ),


];
